## Production: alpha-redirects
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 14 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                          |
|--------|----------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.website_alpha_en`                                                 |
|        | `aws_acm_certificate.website_alpha_fr`                                                 |
|        | `aws_acm_certificate_validation.website_alpha_validation_en`                           |
|        | `aws_acm_certificate_validation.website_alpha_validation_fr`                           |
|        | `aws_cloudfront_distribution.alpha_redirect_en`                                        |
|        | `aws_cloudfront_distribution.alpha_redirect_fr`                                        |
|        | `aws_route53_record.website_alpha_dns_validation_en[&quot;design-system.alpha.canada.ca&quot;]`  |
|        | `aws_route53_record.website_alpha_dns_validation_fr[&quot;systeme-design.alpha.canada.ca&quot;]` |
|        | `aws_s3_bucket_website_configuration.alpha_redirect_en`                                |
|        | `aws_s3_bucket_website_configuration.alpha_redirect_fr`                                |
|        | `module.alpha_redirect_bucket_en.aws_s3_bucket.this`                                   |
|        | `module.alpha_redirect_bucket_en.aws_s3_bucket_public_access_block.this`               |
|        | `module.alpha_redirect_bucket_fr.aws_s3_bucket.this`                                   |
|        | `module.alpha_redirect_bucket_fr.aws_s3_bucket_public_access_block.this`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.website_alpha_en will be created
  + resource "aws_acm_certificate" "website_alpha_en" {
      + arn                       = (known after apply)
      + domain_name               = "design-system.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "design-system.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "design-system.alpha.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.website_alpha_fr will be created
  + resource "aws_acm_certificate" "website_alpha_fr" {
      + arn                       = (known after apply)
      + domain_name               = "systeme-design.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "systeme-design.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "systeme-design.alpha.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.website_alpha_validation_en will be created
  + resource "aws_acm_certificate_validation" "website_alpha_validation_en" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.website_alpha_validation_fr will be created
  + resource "aws_acm_certificate_validation" "website_alpha_validation_fr" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.alpha_redirect_en will be created
  + resource "aws_cloudfront_distribution" "alpha_redirect_en" {
      + aliases                         = [
          + "design-system.alpha.canada.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Alpha EN domain redirect to design-system.canada.ca"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + response_headers_policy_id = "5cc3b908-e619-4b99-88e5-2cf7f45965bd"
          + target_origin_id           = "s3-gc-design-system-alpha-domain-redirect-en-production"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "platform/gc-design-system/alpha-redirect-logs/"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "s3-gc-design-system-alpha-domain-redirect-en-production"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.alpha_redirect_fr will be created
  + resource "aws_cloudfront_distribution" "alpha_redirect_fr" {
      + aliases                         = [
          + "systeme-design.alpha.canada.ca",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Alpha FR domain redirect to systeme-design.canada.ca"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id            = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + response_headers_policy_id = "5cc3b908-e619-4b99-88e5-2cf7f45965bd"
          + target_origin_id           = "s3-gc-design-system-alpha-domain-redirect-fr-production"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
          + prefix          = "platform/gc-design-system/alpha-redirect-logs/"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "s3-gc-design-system-alpha-domain-redirect-fr-production"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.website_alpha_dns_validation_en["design-system.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "website_alpha_dns_validation_en" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0225690P46Z6VL70HFE"
    }

  # aws_route53_record.website_alpha_dns_validation_fr["systeme-design.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "website_alpha_dns_validation_fr" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07797859GC4JIKN15FY"
    }

  # aws_s3_bucket_website_configuration.alpha_redirect_en will be created
  + resource "aws_s3_bucket_website_configuration" "alpha_redirect_en" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "design-system.canada.ca"
          + protocol  = "https"
        }
    }

  # aws_s3_bucket_website_configuration.alpha_redirect_fr will be created
  + resource "aws_s3_bucket_website_configuration" "alpha_redirect_fr" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "systeme-design.canada.ca"
          + protocol  = "https"
        }
    }

  # module.alpha_redirect_bucket_en.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "design-system-alpha-redirect-en"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "gc-design-system-production"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "gc-design-system-production"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.alpha_redirect_bucket_en.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.alpha_redirect_bucket_fr.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "design-system-alpha-redirect-fr"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "gc-design-system-production"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "gc-design-system-production"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.alpha_redirect_bucket_fr.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.alpha_redirect_bucket_en.aws_s3_bucket.this,
  on .terraform/modules/alpha_redirect_bucket_en/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.alpha_redirect_en"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.alpha_redirect_fr"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
